## Fetching Dataset

In [1]:
# from google.colab import drive

# drive.mount("/content/drive")

In [2]:
import numpy as np, pandas as pd

In [3]:
dataset = pd.read_csv("Datasets/Social_Network_Ads_Cleaned.csv")

In [4]:
dataset.head(5)

     UserID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
dataset.tail(5)

       UserID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
dataset

       UserID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [7]:
dataset.rename(columns={"User ID": "UserID"}, inplace=True)

In [8]:
dataset.shape

(400, 5)

In [9]:
print("The dataset has a total of " + str(dataset.shape[0]) + " rows and " + str(dataset.shape[1]) + " columns.")

The dataset has a total of 400 rows and 5 columns.

In [10]:
dat_columns = dataset.columns
dat_columns

Index(['UserID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

## Encoding Data

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
le = LabelEncoder()
dataset["Gender"] = le.fit_transform(dataset["Gender"])

In [13]:
dataset

       UserID  Gender  Age  EstimatedSalary  Purchased
0    15624510       1   19            19000          0
1    15810944       1   35            20000          0
2    15668575       0   26            43000          0
3    15603246       0   27            57000          0
4    15804002       1   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863       0   46            41000          1
396  15706071       1   51            23000          1
397  15654296       0   50            20000          1
398  15755018       1   36            33000          0
399  15594041       0   49            36000          1

[400 rows x 5 columns]

In [14]:
# dataset["Gender"] = dataset["Gender"].map({"Male": 0, "Female": 1})

## Splitting Input & Output Data

In [15]:
x = dataset.iloc[:, [1, 2, 3]]
y = dataset.iloc[:, -1]

In [16]:
x

     Gender  Age  EstimatedSalary
0         1   19            19000
1         1   35            20000
2         0   26            43000
3         0   27            57000
4         1   19            76000
..      ...  ...              ...
395       0   46            41000
396       1   51            23000
397       0   50            20000
398       1   36            33000
399       0   49            36000

[400 rows x 3 columns]

In [17]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

## Splitting Train and Test Set

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size=0.2, random_state=0)

In [20]:
print(X_train.shape)
print(X_test.shape)
print(Y_train.shape)
print(Y_test.shape)

(320, 3)
(80, 3)
(320,)
(80,)

In [21]:
X_train

     Gender  Age  EstimatedSalary
336       1   58           144000
64        0   59            83000
55        0   24            55000
106       0   26            35000
300       0   58            38000
..      ...  ...              ...
323       0   48            30000
192       1   29            43000
117       1   36            52000
47        0   27            54000
172       0   26           118000

[320 rows x 3 columns]

In [22]:
X_test

     Gender  Age  EstimatedSalary
132       1   30            87000
309       0   38            50000
341       1   35            75000
196       0   30            79000
246       0   35            50000
..      ...  ...              ...
14        1   18            82000
363       0   42            79000
304       0   40            60000
361       0   53            34000
329       0   47           107000

[80 rows x 3 columns]

## Scaling Data

In [23]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

**MinMaxScaler:**

*X_{scaled} = (X - X_{min}) / (X_{max} - X_{min})* 

- Scales the data such that all values are in the range [0, 1].
- Preserves the shape of the dataset.
- Also known as Normalization.

In [24]:
sc = MinMaxScaler()
X_train[["Age"]] = sc.fit_transform(X_train[["Age"]])
X_test[["Age"]] = sc.fit_transform(X_test[["Age"]])
X_train[["EstimatedSalary"]] = sc.fit_transform(X_train[["EstimatedSalary"]])
X_test[["EstimatedSalary"]] = sc.fit_transform(X_test[["EstimatedSalary"]])

In [25]:
X_test

     Gender       Age  EstimatedSalary
132       1  0.285714         0.533333
309       0  0.476190         0.259259
341       1  0.404762         0.444444
196       0  0.285714         0.474074
246       0  0.404762         0.259259
..      ...       ...              ...
14        1  0.000000         0.496296
363       0  0.571429         0.474074
304       0  0.523810         0.333333
361       0  0.833333         0.140741
329       0  0.690476         0.681481

[80 rows x 3 columns]

**StandardScaler**

*X_{scaled} = (X - \mu) / \sigma*; 
*\sigma = √[ Σ (X_i - \mu)² / N ]* 

- Scales the data to have a mean of 0 and standard deviation of 1.
- Useful when data distribution is gaussian/normal.
- Also known as Standardization.

In [26]:
# sc = StandardScaler()
# X_train[["Age_scaled"]] = sc.fit_transform(X_train[["Age"]])
# X_test[["Age_scaled"]] = sc.fit_transform(X_test[["Age"]])
# X_train[["EstimatedSalary_scaled"]] = sc.fit_transform(X_train[["EstimatedSalary"]])
# X_test[["EstimatedSalary_scaled"]] = sc.fit_transform(X_test[["EstimatedSalary"]])

In [27]:
# X_test

## Classification

### Modeling

In [28]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import GridSearchCV

In [29]:
# knn_classifier = KNeighborsClassifier(n_neighbors=5, metric="euclidean")
# knn_classifier.fit(X_train, Y_train)

In [30]:
knn_classifier = KNeighborsClassifier()
knn_params = [{"n_neighbors": list(range(5, 15, 2)), "metric": ("euclidean", "manhattan")}]
grid_search = GridSearchCV(estimator=knn_classifier, param_grid=knn_params, cv=5, scoring="accuracy")
grid_search.fit(X_train, Y_train)
knn_classifier = grid_search.best_estimator_

In [31]:
print(grid_search.best_params_)
print(grid_search.best_score_)
print(grid_search.best_estimator_)

{'metric': 'manhattan', 'n_neighbors': 9}
0.903125
KNeighborsClassifier(metric='manhattan', n_neighbors=9)

In [32]:
all_scores = grid_search.cv_results_["mean_test_score"]
print(all_scores)

[0.896875 0.896875 0.896875 0.89375  0.89375  0.9      0.89375  0.903125
 0.89375  0.890625]

In [33]:
Y_pred = knn_classifier.predict(X_test)
Y_pred

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1], dtype=int64)

In [34]:
print(list(Y_pred))

[0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1]

In [35]:
print(list(Y_test))

[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1]

### Evaluation

In [36]:
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score

In [37]:
print("Classification Report: ")
print(classification_report(Y_test, Y_pred))
print("\nConfusion Matrix: ")
print(confusion_matrix(Y_test, Y_pred))

Classification Report:
              precision    recall  f1-score   support

           0       0.98      0.95      0.96        58
           1       0.88      0.95      0.91        22

    accuracy                           0.95        80
   macro avg       0.93      0.95      0.94        80
weighted avg       0.95      0.95      0.95        80


Confusion Matrix:
[[55  3]
 [ 1 21]]

In [38]:
ac = accuracy_score(Y_test, Y_pred)

In [39]:
print(ac)

0.95